'use client'
import './dashboard.scss';
import Link from 'next/link'
import { useAuth } from '@/context/AuthContext'
import { useRouter } from 'next/navigation'
import { useEffect, useState } from 'react'
import Image from 'next/image'

// Імпорти зображень
import levelImage from '../../../assets/Dashboard/photostartlevel.png'
import levelImage2 from '../../../assets/Dashboard/a1.jpg'
import levelImage3 from '../../../assets/Dashboard/a2.jpg'
import levelImage4 from '../../../assets/Dashboard/a2+.jpg'
import levelImage5 from '../../../assets/Dashboard/b1.jpg'
import levelImage6 from '../../../assets/Dashboard/b1+.jpg'
import levelImage7 from '../../../assets/Dashboard/b2.jpg'
import levelImage8 from '../../../assets/Dashboard/b2+.jpg'
import levelImage9 from '../../../assets/Dashboard/c1.jpg'
import Loader from '@/app/components/Loader/Loader'

export default function Account() {
	const { user, loading } = useAuth();
	const router = useRouter();
	const [isLevel, setLevel] = useState('');
	
	// Масив рівнів у правильному порядку
	const levels = ['a1', 'a2', 'a2+', 'b1', 'b1+', 'b2', 'b2+', 'c1'];
	
	// Відповідність рівня та картинки
	const levelImages = {
		'a1': levelImage2,
		'a2': levelImage3,
		'a2+': levelImage4,
		'b1': levelImage5,
		'b1+': levelImage6,
		'b2': levelImage7,
		'b2+': levelImage8,
		'c1': levelImage9,
	};
	
	useEffect(() => {
		if (!loading && !user) {
			router.push('/');
		}
	}, [user, loading, router]);
	
	useEffect(() => {
		if (user?.level)
			setLevel(user.level.toLowerCase());
		else
			setLevel('');
	}, [user?.level]);
	
	// Перехід на попередній рівень
	const prevLevel = () => {
		if (!isLevel) return; // якщо рівень ще не вибрано
		const currentIndex = levels.indexOf(isLevel.toLowerCase());
		if (currentIndex > 0) {
			setLevel(levels[currentIndex - 1]);
		}
	};
	
	// Перехід на наступний рівень
	const nextLevel = () => {
		if (!isLevel) return; // якщо рівень ще не вибрано
		const currentIndex = levels.indexOf(isLevel.toLowerCase());
		if (currentIndex < levels.length - 1) {
			setLevel(levels[currentIndex + 1]);
		}
	};
	
	if (loading) return <Loader/>;
	if (!user) return null;
	
	return (
		<section className="golov-blor-new">
			<div className="box-blok-new">
				<div className="one-section">
					<div className="flex-section-golov">
						
						<button className={`back-button ${isLevel === 'a1' ? 'not-active' : ''}`} onClick={prevLevel}>
							<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
								<path d="M8 15L1 8M1 8L8 1M1 8H15" stroke="black" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
							</svg>
						</button>
						
						<button className={`next-button ${isLevel === 'c1' ? 'not-active' : ''}`} onClick={nextLevel}>
							<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
								<path d="M8 1L15 8M15 8L8 15M15 8L1 8" stroke="black" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
							</svg>
						</button>
						
						{/* Банер рівня */}
						<div className="baner-level">
							{isLevel ? (
								<Image src={levelImages[isLevel]} alt={isLevel} />
							) : (
								<Image src={levelImage} alt="Level" />
							)}
						</div>
						
							<div className="level-info-div">
								<div className={`info-level ${isLevel?.toUpperCase() === user?.level ? 'current' : ''}`}>
									
									{!user.level ?
										<div className={`zagolovok-level`}>
											<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path
													d="M15.21 23L10.66 15.14C10.4638 14.8009 10.3715 14.4116 10.3946 14.0205C10.4177 13.6294 10.5552 13.2537 10.79 12.94L12.4 10.8C12.5863 10.5516 12.8278 10.35 13.1055 10.2111C13.3832 10.0723 13.6895 10 14 10H26C26.3104 10 26.6167 10.0723 26.8944 10.2111C27.1721 10.35 27.4137 10.5516 27.6 10.8L29.2 12.94C29.4363 13.2527 29.5755 13.6278 29.6004 14.019C29.6253 14.4101 29.5347 14.7999 29.34 15.14L24.79 23M19 20L13.12 10.2M21 20L26.88 10.2M16 15H24M20 26V24H19.5M25 25C25 27.7614 22.7614 30 20 30C17.2385 30 15 27.7614 15 25C15 22.2386 17.2385 20 20 20C22.7614 20 25 22.2386 25 25Z"
													stroke="black" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
											</svg>
											<h3 className="medal-h3">Визначи свій рівень</h3>
										</div> :
										<div className={`zagolovok-level ${isLevel?.toUpperCase() === user?.level ? 'current' : ''}`}>
											<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path
													d="M15.21 23L10.66 15.14C10.4638 14.8009 10.3715 14.4116 10.3946 14.0205C10.4177 13.6294 10.5552 13.2537 10.79 12.94L12.4 10.8C12.5863 10.5516 12.8278 10.35 13.1055 10.2111C13.3832 10.0723 13.6895 10 14 10H26C26.3104 10 26.6167 10.0723 26.8944 10.2111C27.1721 10.35 27.4137 10.5516 27.6 10.8L29.2 12.94C29.4363 13.2527 29.5755 13.6278 29.6004 14.019C29.6253 14.4101 29.5347 14.7999 29.34 15.14L24.79 23M19 20L13.12 10.2M21 20L26.88 10.2M16 15H24M20 26V24H19.5M25 25C25 27.7614 22.7614 30 20 30C17.2385 30 15 27.7614 15 25C15 22.2386 17.2385 20 20 20C22.7614 20 25 22.2386 25 25Z"
													stroke="black" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
											</svg>
												<h3 className="medal-h3">Твій рівень</h3>
										</div>
									}
									<div className="level-pokaz-div">
										
										<div className="text-level-div">
											{user?.level ? (
												<>
													{isLevel?.toLowerCase() === 'a1' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Beginner / Starter</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'a2' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Elementary</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'a2+' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Pre-Intermediate</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b1' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Intermediate</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b1+' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Strong-Intermediate</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b2' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Upper-Intermediate</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b2+' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Pre-Advanced</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'c1' &&
														<>
															<h2 className="zagolovok-lev-h2">{isLevel?.toUpperCase()}</h2>
															<h2 className="zagolovok-lev-h22">Advanced</h2>
														</>
													}
												</>
											) : (
												<h2 className="zagolovok-lev-h2">Визначи свій рівень</h2>
											)}
											
											{user?.level ? (
												<>
													{isLevel?.toLowerCase() === 'a1' &&
														<>
															<h2 className="podzagolovok-level">Я знаю кілька слів. Говорю повільно. Але мене вже
																чують.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'a2' &&
														<>
															<h2 className="podzagolovok-level">Я можу розповісти про себе. Помиляюся — і йду
																далі.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'a2+' &&
														<>
															<h2 className="podzagolovok-level">Навіть без слів я поясню.
																Головне — щоб ти зрозумів.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b1' &&
														<>
															<h2 className="podzagolovok-level">Я можу пояснити, чому думаю так. І зробити це
																впевнено.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b1+' &&
														<>
															<h2 className="podzagolovok-level">Ви можете вільно спілкуватися з носіями мови та
																розуміти складні тексти на різні теми.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b2' &&
														<>
															<h2 className="podzagolovok-level">Я не боюся пауз. Я можу бути собою англійською.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'b2+' &&
														<>
															<h2 className="podzagolovok-level">Я змінюю стиль і настрій. Мова — мій інструмент.</h2>
														</>
													}
													{isLevel?.toLowerCase() === 'c1' &&
														<>
															<h2 className="podzagolovok-level">Я думаю, жартую й відчуваю англійською. Це вже
																дім.</h2>
														</>
													}
												</>
											) : (
												<h2 className="podzagolovok-level">Ти не впевнений, наскільки добре знаєш мову? Визнач свій
													рівень!</h2>
											)}
										
										</div>
										<div className="progress-wrapper">
											<svg viewBox="0 0 36 36" className="circular-chart orange" width="100" height="100">
												
												<path
													className="circle-bg"
													d="M18 2.0845
										       a 15.9155 15.9155 0 0 1 0 31.831
										       a 15.9155 15.9155 0 0 1 0 -31.831"
													stroke="#eee"
													strokeWidth="2"
													fill="none"
												/>
											</svg>
											<div className="percentage">{user.level ? '0%' : '?'}</div>
										</div>
									
									</div>
									<div className="level-btn-div">
										{user.level ?
											<Link href={`/level/${isLevel?.toLowerCase()}`} className="level-btn">Вдосконалити даний
												рівень</Link>
											:
											<Link href={'/getlevel'} className="level-btn">Дізнатись свій рівень</Link>
										}
									</div>
								</div>
							</div>
					</div>
				</div>
				<div className="two-section">
					
					<div className="flex-two-section">
						<div className="div-plaz">
							<div className="info-total-progres">
								<div className="icon-total-fine">
									<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path
											d="M36.4255 0V32.8305L7.16037 36.0241L3.57568 36.4153V3.58469C3.57568 2.59477 3.97646 1.6982 4.62522 1.04945C5.27397 0.400703 6.17045 0 7.16037 0H36.4255Z"
											fill="#DA4A54"/>
										<path
											d="M7.16037 0V36.0241L3.57568 36.4153V3.58469C3.57568 2.59477 3.97646 1.6982 4.62522 1.04945C5.27397 0.400703 6.17045 0 7.16037 0Z"
											fill="#C32430"/>
										<path
											d="M36.4258 32.8311H7.16021C5.18053 32.8311 3.57568 34.4359 3.57568 36.4156C3.57568 38.3953 5.18053 40.0001 7.16021 40.0001H36.4258V37.988L34.9673 36.4155L36.4258 34.843V32.8311Z"
											fill="#C32430"/>
										<path
											d="M7.16039 37.9878C6.29328 37.9878 5.58789 37.2824 5.58789 36.4153C5.58789 35.5482 6.29328 34.8428 7.16039 34.8428H36.4259V37.9878H7.16039Z"
												fill="#DFEAEF"/>
											<path d="M16.4837 7.77195L13.8778 5.09742L11.272 7.77195V0H16.4837V7.77195Z" fill="#F4DD45"/>
											<path
												d="M27.8459 10.019H13.9495C12.5562 10.019 11.4268 11.1485 11.4268 12.5418V20.2395C11.4268 21.6328 12.5562 22.7622 13.9495 22.7622H27.8459C29.2392 22.7622 30.3686 21.6328 30.3686 20.2395V12.5418C30.3686 11.1485 29.2392 10.019 27.8459 10.019Z"
												fill="#DFEAEF"/>
											<path
												d="M27.8461 23.366H13.9496C12.2257 23.366 10.8232 21.9635 10.8232 20.2396V12.5419C10.8232 10.818 12.2257 9.41553 13.9496 9.41553H27.8461C29.57 9.41553 30.9725 10.818 30.9725 12.5419V20.2396C30.9725 21.9635 29.57 23.366 27.8461 23.366ZM13.9496 10.6228C12.8914 10.6228 12.0305 11.4837 12.0305 12.5419V20.2396C12.0305 21.2978 12.8914 22.1587 13.9496 22.1587H27.8461C28.9043 22.1587 29.7652 21.2978 29.7652 20.2396V12.5419C29.7652 11.4837 28.9043 10.6228 27.8461 10.6228H13.9496Z"
												fill="#C32430"/>
											<path
												d="M26.5678 15.3952H15.2286C15.0685 15.3952 14.915 15.3316 14.8018 15.2184C14.6886 15.1052 14.625 14.9517 14.625 14.7916C14.625 14.6315 14.6886 14.478 14.8018 14.3648C14.915 14.2516 15.0685 14.188 15.2286 14.188H26.5677C26.7278 14.188 26.8813 14.2516 26.9945 14.3648C27.1077 14.478 27.1713 14.6315 27.1713 14.7916C27.1713 14.8708 27.1558 14.9493 27.1254 15.0226C27.0951 15.0958 27.0507 15.1624 26.9946 15.2184C26.9386 15.2745 26.872 15.3189 26.7988 15.3493C26.7256 15.3796 26.6471 15.3952 26.5678 15.3952ZM26.5678 18.5933H15.2286C15.0685 18.5933 14.915 18.5297 14.8018 18.4165C14.6886 18.3033 14.625 18.1498 14.625 17.9897C14.625 17.8296 14.6886 17.6761 14.8018 17.5629C14.915 17.4497 15.0685 17.3861 15.2286 17.3861H26.5677C26.7278 17.3861 26.8813 17.4497 26.9946 17.5629C27.1078 17.6761 27.1714 17.8296 27.1714 17.9897C27.1714 18.1498 27.1078 18.3033 26.9946 18.4165C26.8814 18.5297 26.7279 18.5933 26.5678 18.5933Z"
												fill="#665E66"/>
										</svg>
									</div>
									<div className="text-total-fine">
										Вивчені слова:
										<div className="number-total-fine">
											0
										</div>
									</div>
								</div>
								<div className="text-total">
									Ти ще не вивчив жодного слова — але це лише початок!
								</div>
								{!user.level &&
								<div className="level-btn-div">
								
									<Link href={'/lesson'} className={`button-filled level-btn ${!user?.level && 'active-not-learning'}`}>Почати навчання</Link>
						
								</div>
								}
							</div>
							<div className="div-plaz">
								<div className="info-total-progres">
									<div className="icon-total-fine">
										<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
											<g clipPath="url(#clip0_189_1229)">
												<path d="M35.6606 16.9321H36.8679V22.4589H35.6606V16.9321Z" fill="#1B81A5"/>
												<path
													d="M30.4573 16.7744H9.5425L7.7175 27.1534C7.6507 27.5334 7.9107 27.8925 8.29219 27.949C9.88149 28.184 14.0667 29.0186 19.6963 31.7854C19.7908 31.8317 19.8946 31.8559 19.9999 31.8559C20.1052 31.8559 20.2091 31.8317 20.3036 31.7854C25.9331 29.0186 30.1184 28.184 31.7077 27.949C32.0891 27.8925 32.3491 27.5334 32.2823 27.1534L30.4573 16.7744Z"
													fill="#33393A"/>
												<path
													d="M32.2825 27.1534L30.4575 16.7744H25.7139L27.833 28.8258C29.6238 28.3057 30.9564 28.0601 31.7078 27.949C32.0893 27.8925 32.3493 27.5334 32.2825 27.1534Z"
													fill="#2A2F33"/>
												<path
													d="M19.8993 8.14417L0.172734 15.9658C-0.0575781 16.0571 -0.0575781 16.383 0.172734 16.4743L19.8993 24.2959C19.964 24.3216 20.0361 24.3216 20.1009 24.2959L39.8274 16.4743C40.0577 16.383 40.0577 16.0574 39.8274 15.9661L20.1009 8.14425C20.0361 8.11858 19.964 8.11851 19.8993 8.14417Z"
													fill="#464C50"/>
												<path
													d="M39.8277 15.9657L34.1108 13.6992L16.8107 20.5589C16.513 20.6767 16.1817 20.6767 15.8839 20.5589L2.23645 15.1476L0.172852 15.9657C-0.0576172 16.057 -0.0576172 16.3829 0.172852 16.4741L13.6424 21.815L19.8994 24.2958C19.9641 24.3214 20.0361 24.3214 20.1008 24.2958L39.8274 16.4741C40.0578 16.3829 40.0578 16.057 39.8277 15.9657Z"
													fill="#2A2F33"/>
												<path
													d="M35.0482 22.2258V23.9385L34.4256 29.9107C34.4209 29.9557 34.4256 30.0011 34.4396 30.0441C34.4536 30.0871 34.4764 30.1267 34.5067 30.1603C34.5369 30.1939 34.5739 30.2207 34.6152 30.2391C34.6565 30.2574 34.7012 30.2669 34.7464 30.2669H37.7823C37.8275 30.2669 37.8722 30.2574 37.9135 30.2391C37.9548 30.2207 37.9917 30.1938 38.022 30.1602C38.0522 30.1267 38.0751 30.0871 38.089 30.0441C38.103 30.0011 38.1078 29.9557 38.103 29.9107L37.4804 23.9385V22.2258C37.4805 22.1596 37.4674 22.0941 37.4421 22.0329C37.4168 21.9717 37.3796 21.9161 37.3328 21.8693C37.286 21.8225 37.2304 21.7854 37.1692 21.76C37.1081 21.7347 37.0425 21.7217 36.9763 21.7217H35.5523C35.4186 21.7217 35.2904 21.7748 35.1959 21.8694C35.1013 21.9639 35.0482 22.0921 35.0482 22.2258Z"
													fill="#FCB038"/>
												<path
													d="M35.0483 22.2258V23.9385H37.4806V22.2258C37.4806 22.1596 37.4676 22.0941 37.4423 22.0329C37.4169 21.9717 37.3798 21.9161 37.333 21.8693C37.2862 21.8225 37.2306 21.7854 37.1694 21.76C37.1082 21.7347 37.0427 21.7217 36.9765 21.7217H35.5525C35.4188 21.7217 35.2906 21.7748 35.196 21.8694C35.1015 21.9639 35.0484 22.0921 35.0483 22.2258Z"
													fill="#F3E8D7"/>
											</g>
											<defs>
												<clipPath id="clip0_189_1229">
													<rect width="40" height="40" fill="white"/>
												</clipPath>
											</defs>
										</svg>
									
									</div>
									<div className="text-total-fine">
										Пройдені уроки:
										<div className="number-total-fine">
											0
										</div>
									</div>
								</div>
								<div className="text-total">
									Перший крок ще попереду — починай зараз і впевнено!
								</div>
								{!user.level &&
								<div className="level-btn-div">
									<Link href={'/lesson'} className={`button-filled level-btn ${!user?.level && 'active-not-learning'}`}>Почати навчання</Link>
								</div>
								}
							</div>
							<div className="div-plaz">
								<div className="info-total-progres">
									<div className="icon-total-fine">
										<svg width="32" height="40" viewBox="0 0 32 40" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path d="M25.1802 12.7977C24.3466 11.8876 23.0507 10.6592 22.4994 13.4328C22.3119 14.3759 21.8738 15.1028 21.4984 15.6881C21.0938 13.6403 19.8765 11.5207 18.7294 10.0916C18.3002 9.55689 16.7773 7.43134 16.4847 3.8754C16.441 3.3447 15.8106 3.09548 15.4163 3.45345C11.6482 6.87408 9.57992 11.5786 9.50312 16.8749C9.50312 16.8749 7.93406 15.5524 7.08164 13.0919C6.85211 12.4293 5.96382 12.3029 5.57843 12.8888C5.50659 12.998 5.4384 13.1095 5.37398 13.2233C2.46671 18.3639 1.0682 24.6065 2.36109 30.4143C4.52281 40.1406 18.8223 42.8599 26.3926 36.7467C33.7992 30.7657 31.4448 19.6338 25.1802 12.7977Z" fill="#ED694A"/>
											<path d="M4.3732 31.025C3.09531 25.155 4.44796 18.8517 7.28695 13.6306C7.21316 13.4531 7.14466 13.2735 7.08156 13.092C6.85203 12.4294 5.96375 12.303 5.57835 12.8889C5.50653 12.9981 5.43837 13.1097 5.37398 13.2234C2.46671 18.364 1.0682 24.6066 2.36109 30.4144C3.3471 34.8508 6.85867 37.8285 11.1048 39.1761C7.79234 37.5714 5.19828 34.8207 4.3732 31.025ZM11.5252 16.7775C11.6821 11.9707 13.4207 7.66051 16.5324 4.34942C16.514 4.19332 16.4981 4.03691 16.4849 3.88028C16.4403 3.34504 15.833 3.07661 15.4404 3.43145C11.8009 6.72192 9.58265 11.3789 9.50304 16.8748L10.1842 17.4038C10.5197 17.6643 10.9742 17.653 11.2946 17.4143C11.4858 17.2523 11.5132 17.0078 11.5252 16.7775Z" fill="#D8553A"/>
											<path d="M22.8944 19.9077C22.2787 19.2355 21.3215 18.3281 20.9143 20.3768C20.7758 21.0733 20.4522 21.6103 20.1751 22.0427C19.8762 20.5301 18.977 18.9645 18.1298 17.9089C17.8128 17.514 16.688 15.9441 16.4718 13.3174C16.4395 12.9254 15.974 12.7414 15.6827 13.0058C12.8995 15.5323 11.3718 19.0073 11.3151 22.9191C11.3151 22.9191 10.1562 21.9423 9.52663 20.1249C9.35709 19.6355 8.70092 19.5422 8.41631 19.9749C8.36325 20.0556 8.31288 20.138 8.2653 20.222C6.11788 24.019 5.08491 28.6298 6.03983 32.9197C7.63655 40.1038 18.1984 42.1123 23.79 37.5969C29.2606 33.1793 27.5216 24.957 22.8944 19.9077Z" fill="#F4A32C"/>
											<path d="M8.03131 33.4833C7.18585 29.2898 8.06155 24.7902 9.91819 21.0433C9.76658 20.7467 9.63572 20.4398 9.52655 20.1251C9.35702 19.6357 8.70085 19.5423 8.41624 19.975C8.36315 20.0557 8.31279 20.1381 8.26522 20.2222C6.11788 24.0191 5.08499 28.63 6.03975 32.9198C6.78241 36.261 9.46452 38.4819 12.6836 39.4484C10.3965 38.3015 8.59569 36.2863 8.03131 33.4833Z" fill="#E89528"/>
											<path d="M20.8081 26.3986C20.3914 25.9436 19.7433 25.3293 19.4677 26.7162C19.374 27.1878 19.1549 27.5512 18.9672 27.8439C18.7649 26.8199 18.1563 25.7601 17.5827 25.0456C17.3681 24.7783 16.6067 23.7155 16.4603 21.9375C16.4384 21.6721 16.1233 21.5475 15.9261 21.7265C14.042 23.4368 13.0079 25.7892 12.9695 28.4372C12.9695 28.4372 12.1849 27.7759 11.7588 26.5458C11.6441 26.2145 11.1999 26.1513 11.0073 26.4442C10.9713 26.4988 10.9372 26.5546 10.905 26.6115C9.45142 29.1818 8.75213 32.303 9.39853 35.207C10.4794 40.0702 17.6292 41.4298 21.4142 38.3732C22.7104 37.3265 23.5141 35.8515 23.6771 34.22C23.9231 31.749 22.972 28.76 20.8081 26.3986Z" fill="#F4D44E"/>
											<path d="M18.8716 32.4222C18.6394 32.1687 18.2784 31.8265 18.1248 32.5991C18.0726 32.8618 17.9506 33.0643 17.846 33.2274C17.7332 32.6569 17.3942 32.0664 17.0746 31.6684C16.9551 31.5194 16.5308 30.9273 16.4492 29.9367C16.437 29.7888 16.2614 29.7196 16.1517 29.8192C15.102 30.7721 14.5258 32.0826 14.5045 33.5579C14.5045 33.5579 14.0674 33.1895 13.8299 32.5041C13.766 32.3195 13.5185 32.2842 13.4113 32.4475C13.3906 32.4788 13.3716 32.5103 13.3544 32.5407C12.5445 33.9728 12.1549 35.7117 12.5151 37.3296C13.3353 41.0195 20.0578 40.9076 20.4701 36.7796C20.607 35.403 20.0771 33.7377 18.8716 32.4222Z" fill="#EAE9E8"/>
											<path d="M14.076 38.0622C13.7158 36.615 14.1054 35.0594 14.9153 33.7785C14.9324 33.7512 14.9516 33.7232 14.9721 33.6951C15.0795 33.5491 15.3269 33.5806 15.3908 33.7457C15.6282 34.3588 16.0653 34.6884 16.0653 34.6884C16.0829 33.604 16.4757 32.6196 17.1972 31.8301C17.0359 31.6067 16.5423 31.0679 16.4492 29.9372C16.437 29.7893 16.2614 29.72 16.1517 29.8196C15.102 30.7725 14.5258 32.0831 14.5045 33.5584C14.5045 33.5584 14.0674 33.19 13.8299 32.5046C13.766 32.32 13.5185 32.2848 13.4113 32.4481C13.3906 32.4794 13.3716 32.5108 13.3544 32.5413C12.5445 33.9732 12.1549 35.7122 12.5151 37.3301C12.8484 38.8297 14.2176 39.731 15.7313 39.9485C14.9148 39.5475 14.2872 38.9125 14.076 38.0622Z" fill="#F7E7A1"/>
											<path d="M10.4222 5.31602C12.1117 3.94187 12.1079 1.37102 10.4222 0C8.73276 1.37406 8.73643 3.945 10.4222 5.31602ZM30.6718 16.3448C32.3613 14.9706 32.3575 12.3998 30.6718 11.0287C29.8996 11.6567 28.9861 14.9738 30.6718 16.3448ZM0.749319 17.3911C1.9669 16.4007 1.96424 14.548 0.749319 13.5598C0.192834 14.0123 -0.465603 16.403 0.749319 17.3911ZM21.8371 9.14734C23.0547 8.15695 23.0521 6.30422 21.8371 5.31602C20.6196 6.30633 20.6223 8.15922 21.8371 9.14734Z" fill="#D8553A"/>
											<path d="M12.8685 22.2909C13.1481 18.9899 14.4086 16.0548 16.5252 13.8173C16.5032 13.6511 16.4854 13.4845 16.4717 13.3174C16.4394 12.9254 15.9738 12.7414 15.6826 13.0058C13.4771 15.0078 12.0617 17.6059 11.5403 20.5446L11.5395 20.5444C11.4941 20.805 11.4551 21.0667 11.4225 21.3293C11.4226 21.3295 11.4227 21.3297 11.4228 21.3299C11.3586 21.8574 11.3226 22.3879 11.3149 22.9192C11.3738 22.9307 12.7073 23.6161 12.8685 22.2909Z" fill="#E89528"/>
											<path d="M11.3469 35.8968C10.7723 33.184 11.2617 30.291 12.3985 27.7843C12.1274 27.404 11.912 26.9869 11.7589 26.5457C11.6441 26.2144 11.2 26.1512 11.0073 26.4441C10.9713 26.4987 10.9372 26.5545 10.905 26.6114C9.45142 29.1817 8.75213 32.3029 9.39853 35.2069C9.90478 37.4844 11.7421 38.9935 13.9413 39.6404C12.6612 38.7906 11.6928 37.5327 11.3469 35.8968ZM15.0438 27.2518C15.2343 25.8904 15.7911 24.3905 16.6676 23.1365C16.5721 22.7825 16.497 22.3824 16.4604 21.9375C16.4385 21.6721 16.1234 21.5475 15.9263 21.7265C14.7524 22.7922 13.9098 24.1077 13.4311 25.5881L13.4299 25.5878C13.3545 25.8204 13.2481 26.2057 13.1835 26.5098C13.1841 26.5097 13.1846 26.5097 13.1852 26.5094C13.0507 27.1434 12.9786 27.7891 12.9699 28.4372C14.0239 28.5687 14.8959 28.3077 15.0438 27.2518Z" fill="#E8C842"/>
										</svg>
									
									</div>
									<div className="text-total-fine">
										Активність:
										<div className="number-total-fine">
											0
										</div>
									</div>
								</div>
								<div className="text-total">
									Ти ще не почав серію — сьогодні гарний день стартувати!
								</div>
								{!user.level &&
								<div className="level-btn-div">
									<Link href={'/lesson'} className={`button-filled level-btn ${!user?.level && 'active-not-learning'}`}>Почати навчання</Link>
								</div>
								}
							</div>
						</div>
					
					</div>
				</div>
			
			</section>
	);
}
